Revit 2026 API

# BuiltInFailuresDetailFailures Class

---

Failures about Detail.

SystemObject Autodesk.Revit.DBBuiltInFailuresDetailFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DetailFailures
```
```vb
Public NotInheritable Class DetailFailures
```
```cpp
public ref class DetailFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DetailFailures = class end
```

The BuiltInFailuresDetailFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EavesAreAligned | All eaves are already aligned. |
|  | NeedsTwoToAlignEaves | At least two Slope Defining Lines are needed to perform Align Eaves. |
|  | RepeatingDetailSpacingZeroError | Spacing must be greater than 0 |

#### Reference

Autodesk.Revit.DB Namespace